In [ ]:
import pandas as pd

In [ ]:
import re

In [ ]:
import numpy as np

In [ ]:
timesData = pd.read_csv("dataframe/timesData.csv")
timesData.head()

In [ ]:
timesData.info()

In [ ]:
timesData['income']=pd.to_numeric(timesData['income'], errors='coerce')

In [ ]:
shanghaiData = pd.read_csv("dataframe/shanghaiData.csv")
shanghaiData.head()

In [ ]:
school_and_country = pd.read_csv("dataframe/school_and_country_table.csv")
school_and_country.head()

In [ ]:
cwurData = pd.read_csv("dataframe/cwurData.csv")
cwurData.head()

In [ ]:
educational_attainment = pd.read_csv("dataframe/educational_attainment_supplementary_data.csv")
educational_attainment.head()

In [ ]:
education_expenditure = pd.read_csv("dataframe/education_expenditure_supplementary_data.csv",engine='python')
education_expenditure.head()

1. For each university, extract from the times dataset the most recent and the least recent data, obtaining two separate dataframe

In [ ]:
most_recent_data=timesData.loc[(timesData.groupby('university_name')['year'].idxmax())]
most_recent_data.head()

In [ ]:
least_recent_data=timesData.loc[(timesData.groupby('university_name')['year'].idxmin())]
least_recent_data.head()

In [ ]:
##timesData[timesData['year']>=timesData['year'].max()]

In [ ]:
##timesData[timesData['university_name']=='Aalto University']

In [ ]:
#timesData.groupby('university_name').min()['year']

In [ ]:
#timesData.groupby('university_name').max()['year']

2. For each university, compute the improvement in "income" between the least recent and the most recent data points

In [ ]:
punto2=pd.merge(most_recent_data, least_recent_data, on='university_name')
punto2.head()

In [ ]:
punto2.columns

In [ ]:
##nuovo_punto2=punto2[punto2[['income_x','income_y']].notnull()]
##nuovo_punto2.head()

In [ ]:
##def calcola_perc(riga):
    ##return riga['income_x'] - riga['income_y']

In [ ]:
##nuovo_punto2['income_improvement']=nuovo_punto2.apply(calcola_perc, axis=1)
##nuovo_punto2.head()

In [ ]:
##nuovo_punto2['differenza']=nuovo_punto2['income_x']-nuovo_punto2['income_y']
##nuovo_punto2

In [ ]:
#nuovo_punto2[nuovo_punto2['income_y']-nuovo_punto2['income_x']]

In [ ]:
##lista=nuovo_punto2['income_x']
##lista

In [ ]:
##nuovo=lista.astype(float)
##nuovo

In [ ]:
def calcola_perc(riga):
    return riga['votes_first_vote']/ risultato[riga['state']] *100

In [ ]:
##nuovo_punto2['income_y']=nuovo_punto2['income_y'].to_numeric()

In [ ]:
##nuovo_punto2=np.array(list, dtype=float)

In [ ]:
punto2['income_improvement']=punto2['income_y']-punto2['income_x']
punto2.head()

3. Find the university with the largest increase computed in the previous point

In [ ]:
punto2.loc[punto2['income_improvement']>= punto2['income_improvement'].max()]['university_name'] #possiamo anche togliere l'ultima quadra

4. For each ranking, consider only the most recent data point. For each university, compute the maximum difference between the rankings (e.g. for Aarhus University the value is 122-73=49). Notice that some rankings are expressed as a range

In [ ]:
most_recent_s=shanghaiData.loc[(shanghaiData.groupby('university_name')['year'].idxmax())]
most_recent_c=cwurData.loc[(cwurData.groupby('institution')['year'].idxmax())]
#most_recent_data

In [ ]:
##most_recent_data[most_recent_data['university_name'] == 'Aarhus University']
##most_recent_s[most_recent_s['university_name'] == 'Aarhus University']
##most_recent_c[most_recent_c['institution'] == 'Aarhus University']

In [ ]:
most_recent_data['world_rank']

In [ ]:
lista = most_recent_data['world_rank']
df =pd.DataFrame(lista)
df.head()

In [ ]:
df['min_range'] = df['world_rank'].str.extract(r'^\=?(\d+)')
df['max_range'] = df['world_rank'].str.extract(r'(\d+$)')
df.head()

In [ ]:
df['min_range']=pd.to_numeric(df['min_range'], errors='coerce')
df['max_range']=pd.to_numeric(df['max_range'], errors='coerce')
df.info()

In [ ]:
most_recent_data['world_rank_t'] = (df['max_range'] + df['min_range'])//2
most_recent_data['world_rank_t'].head()

In [ ]:
#rifacciamo per s
lista_s = most_recent_s['world_rank']
df_s =pd.DataFrame(lista_s)
df_s['min_range'] = df_s['world_rank'].str.extract(r'^\=?(\d+)')
df_s['max_range'] = df_s['world_rank'].str.extract(r'(\d+$)')
df_s['min_range']=pd.to_numeric(df_s['min_range'], errors='coerce')
df_s['max_range']=pd.to_numeric(df_s['max_range'], errors='coerce')
most_recent_s['world_rank_s'] = (df_s['max_range'] + df_s['min_range'])//2
most_recent_s.head()

In [ ]:
most_recent_c.info()

In [ ]:
most_recent = pd.merge(most_recent_data, most_recent_s, on='university_name', how='left' )
most_recent

In [ ]:
most_recent1 = pd.merge(most_recent, most_recent_c, left_on= 'university_name', right_on = 'institution', how='left')
most_recent1

In [ ]:
most_recent1.columns

In [ ]:
most_recent1['HighScore'] = most_recent1[['world_rank_t','world_rank','world_rank_s']].max(axis = 1)
most_recent1['LowScore'] = most_recent1[['world_rank_t','world_rank','world_rank_s']].min(axis = 1)
most_recent1['maximum_difference'] = most_recent1['HighScore']-most_recent1['LowScore']
most_recent1[['university_name','maximum_difference','HighScore','LowScore','world_rank_t','world_rank','world_rank_s']]

5. Consider only the most recent data point of the times dataset. Compute the number of male and female students for each country.

In [ ]:
#most_recent_data.head()

In [ ]:
#most_recent_data['year']

In [ ]:
#rapporto=most_recent_data['female_male_ratio']
#rapporto.head()

In [ ]:
#dataframe=pd.DataFrame(rapporto)
#dataframe.head()

In [ ]:
most_recent_data.info()

In [ ]:
most_recent_data['female'] = most_recent_data['female_male_ratio'].str.extract(r'(^\d+)')
most_recent_data['male'] = most_recent_data['female_male_ratio'].str.extract(r'(\d+$)')
most_recent_data.head()

In [ ]:
most_recent_data['male']=pd.to_numeric(most_recent_data['male'], errors='coerce')
most_recent_data['female']=pd.to_numeric(most_recent_data['female'], errors='coerce')

In [ ]:
most_recent_data.info()

In [ ]:
most_recent_data['num_students'] = most_recent_data['num_students'].str.replace(',','')
most_recent_data.head()

In [ ]:
most_recent_data['num_students']=pd.to_numeric(most_recent_data['num_students'], errors='coerce')
most_recent_data.head()

In [ ]:
##def calc_numero(row):
    ##return most_recent_data['num_students']* most_recent_data[row]//100

In [ ]:
#most_recent_data['num_male']=most_recent_data['male'].apply(calc_numero, axis= 1)

In [ ]:
most_recent_data['num_male']= most_recent_data['male'] * most_recent_data['num_students'] // 100
most_recent_data.head()

In [ ]:
most_recent_data['num_fem']= most_recent_data['female'] * most_recent_data['num_students'] // 100
most_recent_data.head()

6. Find the universities where the ratio between female and male is below the average ratio (computed over all universities)

In [ ]:
most_recent_data['rapporto'] = most_recent_data['num_fem'] / most_recent_data['num_male']
media = most_recent_data['rapporto'].notnull().mean()

In [ ]:
punto6 = most_recent_data.loc[most_recent_data['rapporto'] <= media]
punto6.head()

In [ ]:
punto6['university_name']

7. For each country, compute the fraction of the students in the country that are in one of the universities computed in the previous point (that is, the denominator of the ratio is the total number of students over all universities in the country).

In [ ]:
#denominatore
deno = most_recent_data.groupby('country', as_index = True)['num_students'].sum()
#numeratore
deno

In [ ]:
num=punto6.groupby('country')['num_students'].sum()

In [ ]:
num.dtype

In [ ]:
deno.dtype

In [ ]:
fraction=num/deno
fraction

In [ ]:
#most_recent_data.loc[most_recent_data.groupby('country').sum()['num_students']]

8. Read the file educational_attainment_supplementary_data.csv, discarding any row with missing country_name or series_name

In [ ]:
educational_attainment = pd.read_csv("dataframe/educational_attainment_supplementary_data.csv")
educational_attainment.head()

In [ ]:
#educational_attainment.dropna(educational_attainment,how="any", thresh=None, subset=(['country_name','series_name']), inplace=True)
#educational_attainment.head()

In [ ]:
educ = educational_attainment[(educational_attainment['country_name'].notnull()) | (educational_attainment['series_name'].notnull())]
educ.head()

In [ ]:
#educational_attainment.dropna?

9. From attainment build a dataframe with the same data, but with 4 columns: country_name, series_name, year, value

In [ ]:
ed_pulito= educ.dropna(axis='columns', how='all')
ed_pulito.head()

In [ ]:
#ed_pulito[ed_pulito['1986'].notnull()]

In [ ]:
pd.melt?

In [ ]:
ed_pulito.columns[2:]

In [ ]:
pd.melt(ed_pulito, id_vars=['country_name','series_name'], value_vars=['1985', '1986', '1987', '1990', '1991', '1992', '1993', '1995', '1996',
       '1998', '1999', '2000', '2001', '2002', '2003', '2004', '2005', '2006',
       '2007', '2008', '2009', '2010', '2011', '2012', '2013'])

10. For each university, find the number of rankings in which they appear (it suffices to appear in one year for each ranking).

In [ ]:
#tab=pd.merge(timesData, shanghaiData, on='university_name')
#tab_merge=pd.merge(tab, cwurData, left_on='university_name', right_on='institution')
#tab_merge

In [63]:
tabella_merge=pd.merge(school_and_country, timesData, left_on='school_name', right_on='university_name', how='left')
tabella_merge.loc[tabella_merge['university_name'].isnull()]

Empty DataFrame
Columns: [school_name, country_x, world_rank, university_name, country_y, teaching, international, research, citations, income, total_score, num_students, student_staff_ratio, international_students, female_male_ratio, year]
Index: []

In [65]:
tabella_merge1=pd.merge(tabella_merge, shanghaiData, left_on='school_name', right_on='university_name', how='left')
tabella_merge1.head()
tabella_merge1.loc[tabella_merge1['university_name_y'].isnull()]

,school_name,country_x,world_rank_x,university_name_x,country_y,teaching,international,research,citations,income,...,university_name_y,national_rank,total_score_y,alumni,award,hici,ns,pub,pcp,year_y
132,Massachusetts Institute of Technology,United States of America,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
133,Massachusetts Institute of Technology,United States of America,7,Massachusetts Institute of Technology,United States of America,92.7,79.2,87.4,100.0,94.4,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
134,Massachusetts Institute of Technology,United States of America,5,Massachusetts Institute of Technology,United States of America,92.9,81.6,89.2,99.9,92.9,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
135,Massachusetts Institute of Technology,United States of America,5,Massachusetts Institute of Technology,United States of America,92.9,82.0,89.0,100.0,94.3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
136,Massachusetts Institute of Technology,United States of America,6,Massachusetts Institute of Technology,United States of America,89.1,84.3,88.2,100.0,95.7,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
14557,Xidian University,China,601-800,Xidian University,China,17.9,12.8,12.1,8.9,83.7,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14558,Yeungnam University,South Korea,601-800,Yeungnam University,South Korea,18.6,24.3,10.9,26.5,35.4,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14559,Yıldız Technical University,Turkey,601-800,Yıldız Technical University,Turkey,14.5,14.9,7.6,19.3,44.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14560,Yokohama City University,Japan,601-800,Yokohama City University,Japan,24.0,16.1,10.2,36.4,37.9,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14561,Yokohama National University,Japan,601-800,Yokohama National University,Japan,20.1,23.3,16.0,13.5,40.4,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [66]:
tabella_merge3=pd.merge(tabella_merge1, cwurData, left_on='school_name', right_on='institution', how='left')
tabella_merge3.head()

,school_name,country_x,world_rank_x,university_name_x,country_y,teaching,international,research,citations_x,income,...,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations_y,broad_impact,patents,score,year
0,Harvard University,United States of America,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,...,7.0,9.0,1.0,1.0,1.0,1.0,NaN,5.0,100.0,2012.0
1,Harvard University,United States of America,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,...,1.0,1.0,1.0,1.0,1.0,1.0,NaN,7.0,100.0,2013.0
2,Harvard University,United States of America,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,...,1.0,1.0,1.0,1.0,1.0,1.0,1.0,2.0,100.0,2014.0
3,Harvard University,United States of America,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,...,1.0,1.0,1.0,1.0,1.0,1.0,1.0,3.0,100.0,2015.0
4,Harvard University,United States of America,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,...,7.0,9.0,1.0,1.0,1.0,1.0,NaN,5.0,100.0,2012.0

In [67]:
tabella_merge3.columns

Index(['school_name', 'country_x', 'world_rank_x', 'university_name_x',
       'country_y', 'teaching', 'international', 'research', 'citations_x',
       'income', 'total_score_x', 'num_students', 'student_staff_ratio',
       'international_students', 'female_male_ratio', 'year_x', 'world_rank_y',
       'university_name_y', 'national_rank_x', 'total_score_y', 'alumni',
       'award', 'hici', 'ns', 'pub', 'pcp', 'year_y', 'world_rank',
       'institution', 'country', 'national_rank_y', 'quality_of_education',
       'alumni_employment', 'quality_of_faculty', 'publications', 'influence',
       'citations_y', 'broad_impact', 'patents', 'score', 'year'],
      dtype='object')

In [75]:
tabella_merge3.groupby('school_name').tabella_merge3['world_rank'].isnull().values.ravel().sum()

AttributeError: 'DataFrameGroupBy' object has no attribute 'tabella_merge3'

In [71]:
punto10=tabella_merge3.loc[(tabella_merge3['world_rank_x'].isnull())|(tabella_merge3['world_rank_y'].isnull()) | (tabella_merge3['world_rank'].isnull())][['world_rank_x','world_rank_y','world_rank','school_name']]
punto10

,world_rank_x,world_rank_y,world_rank,school_name
528,3,NaN,2.0,Massachusetts Institute of Technology
529,3,NaN,4.0,Massachusetts Institute of Technology
530,3,NaN,3.0,Massachusetts Institute of Technology
531,3,NaN,3.0,Massachusetts Institute of Technology
532,7,NaN,2.0,Massachusetts Institute of Technology
...,...,...,...,...
35566,601-800,NaN,NaN,Yıldız Technical University
35567,601-800,NaN,461.0,Yokohama City University
35568,601-800,NaN,513.0,Yokohama City University
35569,601-800,NaN,339.0,Yokohama National University
35570,601-800,NaN,518.0,Yokohama National University

In [ ]:
punto10.loc[(punto10.groupby('school_name')['institution'].unique())]

In [ ]:
#pd.punto10(['school_name'], index=False).unique()
pd.unique(punto10['school_name'])
#punto10.['school_name'].unique

11. In the times ranking, compute the number of times each university appears

In [ ]:
punto11 = timesData.groupby('university_name', as_index = False)['world_rank'].count()
punto11

12. Find the universities that appear at most twice in the times ranking.

In [ ]:
punto12 = punto11[punto11['world_rank']<= 2]
punto12

13. The universities that, in any year, have the same position in all three rankings (they must have the same position in a year).

In [78]:
punto13 = pd.merge(timesData, cwurData, left_on=['university_name','year'], right_on = ['institution','year'])
punto13= pd.merge(punto13, shanghaiData, on= ['university_name', 'year'])
punto13= punto13.rename(columns= {'world_rank_x':'times','world_rank_y': 'cwur','world_rank' : 'shanghai'})

In [103]:
punto13= punto13[['university_name','year','times','cwur','shanghai']]
punto13.head()

In [99]:
punto13.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 551 entries, 0 to 550
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   university_name  551 non-null    object
 1   year             551 non-null    int64
 2   times            551 non-null    object
 3   cwur             551 non-null    int64
 4   shanghai         551 non-null    object
dtypes: int64(2), object(3)
memory usage: 25.8+ KB

In [102]:
punto13 = punto13.loc[(punto13['times'] == punto13['shanghai'])]
punto13

                             university_name  year times  cwur shanghai
2                        Stanford University  2012     2     3        2
6                      University of Chicago  2012     9    11        9
8                            Yale University  2012    11     8       11
60                       Stanford University  2013     2     2        2
67                           Yale University  2013    11    10       11
70                University of Pennsylvania  2013    15    12       15
79   University of California, Santa Barbara  2013    35    37       35
109                     Princeton University  2014     6     9        6
111                    University of Chicago  2014     9     8        9
112                          Yale University  2014    11    10       11
113    University of California, Los Angeles  2014    12    15       12
115               University of Pennsylvania  2014    16    14       16
331                  University of Cambridge  2015     5     4        5
336    University of California, Los Angeles  2015    12    15       12

In [105]:
punto13['times']=pd.to_numeric(punto13['times'], errors='coerce')
punto13['shanghai']=pd.to_numeric(punto13['shanghai'], errors='coerce')
punto13.loc[(punto13['times'] == punto13['cwur'])]

        university_name  year  times  cwur  shanghai
60  Stanford University  2013      2     2         2